---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendHorOriginGap
source: html/f8342ccd-a969-bcbf-1f18-a1c19cc4750c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpatialFieldMgrLegendHorOriginGap Property

"Legend Horizontal Origin Gap"

## Syntax (C#)
```csharp
public static ForgeTypeId SpatialFieldMgrLegendHorOriginGap { get; }
```